In [ ]:
# 출처:
https://blockchainstudy.tistory.com/45

In [29]:
import pandas as pd
import numpy as np 

df = pd.read_csv("C:\\Python\\Dataset\\titanic.csv")
df.head()

,Unnamed: 0,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop("Unnamed: 0", axis=1, inplace=True)

In [4]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# A quick introduction to MultiIndex
df.index.names  #  “None”-> default value of a DataFrame’s index.

FrozenList([None])

In [14]:
# create a MultiIndex
multi=df.set_index(["Sex","Age"])
multi.head()

             Survived  Pclass  \
Sex    Age
male   22.0         0       3
female 38.0         1       1
       26.0         1       3
       35.0         1       1
male   35.0         0       3

                                                          Name  SibSp  Parch  \
Sex    Age
male   22.0                            Braund, Mr. Owen Harris      1      0
female 38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...      1      0
       26.0                             Heikkinen, Miss. Laina      0      0
       35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1      0
male   35.0                           Allen, Mr. William Henry      0      0

                       Ticket     Fare Cabin Embarked
Sex    Age
male   22.0         A/5 21171   7.2500   NaN        S
female 38.0          PC 17599  71.2833   C85        C
       26.0  STON/O2. 3101282   7.9250   NaN        S
       35.0            113803  53.1000  C123        S
male   35.0            373450   8.0500   NaN        S

In [15]:
multi.index.names

FrozenList(['Sex', 'Age'])

In [16]:
multi.index.values # index인 name, sex, age에 대한 정보 출력

array([('male', 22.0), ('female', 38.0), ('female', 26.0),
       ('female', 35.0), ('male', 35.0), ('male', nan), ('male', 54.0),
       ('male', 2.0), ('female', 27.0), ('female', 14.0), ('female', 4.0),
       ('female', 58.0), ('male', 20.0), ('male', 39.0), ('female', 14.0),
       ('female', 55.0), ('male', 2.0), ('male', nan), ('female', 31.0),
       ('female', nan), ('male', 35.0), ('male', 34.0), ('female', 15.0),
       ('male', 28.0), ('female', 8.0), ('female', 38.0), ('male', nan),
       ('male', 19.0), ('female', nan), ('male', nan), ('male', 40.0),
       ('female', nan), ('female', nan), ('male', 66.0), ('male', 28.0),
       ('male', 42.0), ('male', nan), ('male', 21.0), ('female', 18.0),
       ('female', 14.0), ('female', 40.0), ('female', 27.0),
       ('male', nan), ('female', 3.0), ('female', 19.0), ('male', nan),
       ('male', nan), ('female', nan), ('male', nan), ('female', 18.0),
       ('male', 7.0), ('male', 21.0), ('female', 49.0), ('female', 29.0),
       ('male', 65.0), ('male', nan), ('female', 21.0), ('male', 28.5),
       ('female', 5.0), ('male', 11.0), ('male', 22.0), ('female', 38.0),
       ('male', 45.0), ('male', 4.0), ('male', nan), ('male', nan),
       ('female', 29.0), ('male', 19.0), ('female', 17.0), ('male', 26.0),
       ('male', 32.0), ('female', 16.0), ('male', 21.0), ('male', 26.0),
       ('male', 32.0), ('male', 25.0), ('male', nan), ('male', nan),
       ('male', 0.83), ('female', 30.0), ('male', 22.0), ('male', 29.0),
       ('female', nan), ('male', 28.0), ('female', 17.0),
       ('female', 33.0), ('male', 16.0), ('male', nan), ('female', 23.0),
       ('male', 24.0), ('male', 29.0), ('male', 20.0), ('male', 46.0),
       ('male', 26.0), ('male', 59.0), ('male', nan), ('male', 71.0),
       ('male', 23.0), ('female', 34.0), ('male', 34.0), ('female', 28.0),
       ('male', nan), ('male', 21.0), ('male', 33.0), ('male', 37.0),
       ('male', 28.0), ('female', 21.0), ('male', nan), ('male', 38.0),
       ('female', nan), ('male', 47.0), ('female', 14.5), ('male', 22.0),
       ('female', 20.0), ('female', 17.0), ('male', 21.0), ('male', 70.5),
       ('male', 29.0), ('male', 24.0), ('female', 2.0), ('male', 21.0),
       ('male', nan), ('male', 32.5), ('female', 32.5), ('male', 54.0),
       ('male', 12.0), ('male', nan), ('male', 24.0), ('female', nan),
       ('male', 45.0), ('male', 33.0), ('male', 20.0), ('female', 47.0),
       ('female', 29.0), ('male', 25.0), ('male', 23.0), ('female', 19.0),
       ('male', 37.0), ('male', 16.0), ('male', 24.0), ('female', nan),
       ('female', 22.0), ('female', 24.0), ('male', 19.0), ('male', 18.0),
       ('male', 19.0), ('male', 27.0), ('female', 9.0), ('male', 36.5),
       ('male', 42.0), ('male', 51.0), ('female', 22.0), ('male', 55.5),
       ('male', 40.5), ('male', nan), ('male', 51.0), ('female', 16.0),
       ('male', 30.0), ('male', nan), ('male', nan), ('male', 44.0),
       ('female', 40.0), ('male', 26.0), ('male', 17.0), ('male', 1.0),
       ('male', 9.0), ('female', nan), ('female', 45.0), ('male', nan),
       ('male', 28.0), ('male', 61.0), ('male', 4.0), ('female', 1.0),
       ('male', 21.0), ('male', 56.0), ('male', 18.0), ('male', nan),
       ('female', 50.0), ('male', 30.0), ('male', 36.0), ('female', nan),
       ('male', nan), ('male', 9.0), ('male', 1.0), ('female', 4.0),
       ('male', nan), ('female', nan), ('male', 45.0), ('male', 40.0),
       ('male', 36.0), ('female', 32.0), ('male', 19.0), ('female', 19.0),
       ('male', 3.0), ('female', 44.0), ('female', 58.0), ('male', nan),
       ('male', 42.0), ('female', nan), ('female', 24.0), ('male', 28.0),
       ('male', nan), ('male', 34.0), ('male', 45.5), ('male', 18.0),
       ('female', 2.0), ('male', 32.0), ('male', 26.0), ('female', 16.0),
       ('male', 40.0), ('male', 24.0), ('female', 35.0), ('male', 22.0),
       ('male', 30.0), ('male', nan), ('female', 31.0), ('female', 27.0),
       ('male', 42.0), ('female', 32.0), ('male', 30.0), ('male', 16.0),
       ('male', 27.0), ('male', 51.0), ('male', nan), ('male', 38.0),
       ('male', 22.0), ('male', 19.0), ('male', 20.5), ('male', 18.0),
       ('female', nan), ('female', 35.0), ('male', 29.0), ('male', 59.0),
       ('female', 5.0), ('male', 24.0), ('female', nan), ('male', 44.0),
       ('female', 8.0), ('male', 19.0), ('male', 33.0), ('female', nan),
       ('female', nan), ('male', 29.0), ('male', 22.0), ('male', 30.0),
       ('male', 44.0), ('female', 25.0), ('female', 24.0), ('male', 37.0),
       ('male', 54.0), ('male', nan), ('female', 29.0), ('male', 62.0),
       ('male', 30.0), ('female', 41.0), ('female', 29.0),
       ('female', nan), ('female', 30.0), ('female', 35.0),
       ('female', 50.0), ('male', nan), ('male', 3.0), ('male', 52.0),
       ('male', 40.0), ('female', nan), ('male', 36.0), ('male', 16.0),
       ('male', 25.0), ('female', 58.0), ('female', 35.0), ('male', nan),
       ('male', 25.0), ('female', 41.0), ('male', 37.0), ('female', nan),
       ('female', 63.0), ('female', 45.0), ('male', nan), ('male', 7.0),
       ('female', 35.0), ('male', 65.0), ('male', 28.0), ('male', 16.0),
       ('male', 19.0), ('male', nan), ('male', 33.0), ('male', 30.0),
       ('male', 22.0), ('male', 42.0), ('female', 22.0), ('female', 26.0),
       ('female', 19.0), ('male', 36.0), ('female', 24.0), ('male', 24.0),
       ('male', nan), ('male', 23.5), ('female', 2.0), ('male', nan),
       ('female', 50.0), ('female', nan), ('male', nan), ('male', 19.0),
       ('female', nan), ('male', nan), ('male', 0.92), ('female', nan),
       ('female', 17.0), ('male', 30.0), ('female', 30.0),
       ('female', 24.0), ('female', 18.0), ('female', 26.0),
       ('male', 28.0), ('male', 43.0), ('female', 26.0), ('female', 24.0),
       ('male', 54.0), ('female', 31.0), ('female', 40.0), ('male', 22.0),
       ('male', 27.0), ('female', 30.0), ('female', 22.0), ('male', nan),
       ('female', 36.0), ('male', 61.0), ('female', 36.0),
       ('female', 31.0), ('female', 16.0), ('female', nan),
       ('male', 45.5), ('male', 38.0), ('male', 16.0), ('female', nan),
       ('male', nan), ('male', 29.0), ('female', 41.0), ('male', 45.0),
       ('male', 45.0), ('male', 2.0), ('female', 24.0), ('male', 28.0),
       ('male', 25.0), ('male', 36.0), ('female', 24.0), ('female', 40.0),
       ('female', nan), ('male', 3.0), ('male', 42.0), ('male', 23.0),
       ('male', nan), ('male', 15.0), ('male', 25.0), ('male', nan),
       ('male', 28.0), ('female', 22.0), ('female', 38.0),
       ('female', nan), ('female', nan), ('male', 40.0), ('male', 29.0),
       ('female', 45.0), ('male', 35.0), ('male', nan), ('male', 30.0),
       ('female', 60.0), ('female', nan), ('female', nan),
       ('female', 24.0), ('male', 25.0), ('male', 18.0), ('male', 19.0),
       ('male', 22.0), ('female', 3.0), ('female', nan), ('female', 22.0),
       ('male', 27.0), ('male', 20.0), ('male', 19.0), ('female', 42.0),
       ('female', 1.0), ('male', 32.0), ('female', 35.0), ('male', nan),
       ('male', 18.0), ('male', 1.0), ('female', 36.0), ('male', nan),
       ('female', 17.0), ('male', 36.0), ('male', 21.0), ('male', 28.0),
       ('female', 23.0), ('female', 24.0), ('male', 22.0),
       ('female', 31.0), ('male', 46.0), ('male', 23.0), ('female', 28.0),
       ('male', 39.0), ('male', 26.0), ('female', 21.0), ('male', 28.0),
       ('female', 20.0), ('male', 34.0), ('male', 51.0), ('male', 3.0),
       ('male', 21.0), ('female', nan), ('male', nan), ('male', nan),
       ('female', 33.0), ('male', nan), ('male', 44.0), ('female', nan),
       ('female', 34.0), ('female', 18.0), ('male', 30.0),
       ('female', 10.0), ('male', nan), ('male', 21.0), ('male', 29.0),
       ('female', 28.0), ('male', 18.0), ('male', nan), ('female', 28.0),
       ('female', 19.0), ('male', nan), ('male', 32.0), ('male', 28.0),
       ('female', nan), ('female', 42.0), ('male', 17.0), ('male', 50.0),
       ('female', 14.0), ('female', 21.0), ('female', 24.0),
       ('male', 64.0), ('male', 31.0), ('female', 45.0), ('male', 20.0),
       ('male', 25.0), ('female', 28.0), ('male', nan), ('male', 4.0),
       ('female', 13.0), ('male', 34.0), ('female', 5.0), ('male', 52.0),
       ('male', 36.0), ('male', nan), ('male', 30.0), ('male', 49.0),
       ('male', nan), ('male', 29.0), ('male', 65.0), ('female', nan),
       ('female', 50.0), ('male', nan), ('male', 48.0), ('male', 34.0),
       ('male', 47.0), ('male', 48.0), ('male', nan), ('male', 38.0),
       ('male', nan), ('male', 56.0), ('male', nan), ('female', 0.75),
       ('male', nan), ('male', 38.0), ('female', 33.0), ('female', 23.0),
       ('female', 22.0), ('male', nan), ('male', 34.0), ('male', 29.0),
       ('male', 22.0), ('female', 2.0), ('male', 9.0), ('male', nan),
       ('male', 50.0), ('female', 63.0), ('male', 25.0), ('female', nan),
       ('female', 35.0), ('male', 58.0), ('male', 30.0), ('male', 9.0),
       ('male', nan), ('male', 21.0), ('male', 55.0), ('male', 71.0),
       ('male', 21.0), ('male', nan), ('female', 54.0), ('male', nan),
       ('female', 25.0), ('male', 24.0), ('male', 17.0), ('female', 21.0),
       ('female', nan), ('female', 37.0), ('female', 16.0),
       ('male', 18.0), ('female', 33.0), ('male', nan), ('male', 28.0),
       ('male', 26.0), ('male', 29.0), ('male', nan), ('male', 36.0),
       ('female', 54.0), ('male', 24.0), ('male', 47.0), ('female', 34.0),
       ('male', nan), ('female', 36.0), ('male', 32.0), ('female', 30.0),
       ('male', 22.0), ('male', nan), ('female', 44.0), ('male', nan),
       ('male', 40.5), ('female', 50.0), ('male', nan), ('male', 39.0),
       ('male', 23.0), ('female', 2.0), ('male', nan), ('male', 17.0),
       ('female', nan), ('female', 30.0), ('female', 7.0), ('male', 45.0),
       ('female', 30.0), ('male', nan), ('female', 22.0),
       ('female', 36.0), ('female', 9.0), ('female', 11.0),
       ('male', 32.0), ('male', 50.0), ('male', 64.0), ('female', 19.0),
       ('male', nan), ('male', 33.0), ('male', 8.0), ('male', 17.0),
       ('male', 27.0), ('male', nan), ('male', 22.0), ('female', 22.0),
       ('male', 62.0), ('female', 48.0), ('male', nan), ('female', 39.0),
       ('female', 36.0), ('male', nan), ('male', 40.0), ('male', 28.0),
       ('male', nan), ('female', nan), ('male', 24.0), ('male', 19.0),
       ('female', 29.0), ('male', nan), ('male', 32.0), ('male', 62.0),
       ('female', 53.0), ('male', 36.0), ('female', nan), ('male', 16.0),
       ('male', 19.0), ('female', 34.0), ('female', 39.0),
       ('female', nan), ('male', 32.0), ('female', 25.0),
       ('female', 39.0), ('male', 54.0), ('male', 36.0), ('male', nan),
       ('female', 18.0), ('male', 47.0), ('male', 60.0), ('male', 22.0),
       ('male', nan), ('male', 35.0), ('female', 52.0), ('male', 47.0),
       ('female', nan), ('male', 37.0), ('male', 36.0), ('female', nan),
       ('male', 49.0), ('male', nan), ('male', 49.0), ('female', 24.0),
       ('male', nan), ('male', nan), ('male', 44.0), ('male', 35.0),
       ('male', 36.0), ('male', 30.0), ('male', 27.0), ('female', 22.0),
       ('female', 40.0), ('female', 39.0), ('male', nan), ('female', nan),
       ('male', nan), ('male', 35.0), ('female', 24.0), ('male', 34.0),
       ('female', 26.0), ('female', 4.0), ('male', 26.0), ('male', 27.0),
       ('male', 42.0), ('male', 20.0), ('male', 21.0), ('male', 21.0),
       ('male', 61.0), ('male', 57.0), ('female', 21.0), ('male', 26.0),
       ('male', nan), ('male', 80.0), ('male', 51.0), ('male', 32.0),
       ('male', nan), ('female', 9.0), ('female', 28.0), ('male', 32.0),
       ('male', 31.0), ('female', 41.0), ('male', nan), ('male', 20.0),
       ('female', 24.0), ('female', 2.0), ('male', nan), ('female', 0.75),
       ('male', 48.0), ('male', 19.0), ('male', 56.0), ('male', nan),
       ('female', 23.0), ('male', nan), ('female', 18.0), ('male', 21.0),
       ('female', nan), ('female', 18.0), ('male', 24.0), ('male', nan),
       ('female', 32.0), ('male', 23.0), ('male', 58.0), ('male', 50.0),
       ('male', 40.0), ('male', 47.0), ('male', 36.0), ('male', 20.0),
       ('male', 32.0), ('male', 25.0), ('male', nan), ('male', 43.0),
       ('female', nan), ('female', 40.0), ('male', 31.0), ('male', 70.0),
       ('male', 31.0), ('male', nan), ('male', 18.0), ('male', 24.5),
       ('female', 18.0), ('female', 43.0), ('male', 36.0),
       ('female', nan), ('male', 27.0), ('male', 20.0), ('male', 14.0),
       ('male', 60.0), ('male', 25.0), ('male', 14.0), ('male', 19.0),
       ('male', 18.0), ('female', 15.0), ('male', 31.0), ('female', 4.0),
       ('male', nan), ('male', 25.0), ('male', 60.0), ('male', 52.0),
       ('male', 44.0), ('female', nan), ('male', 49.0), ('male', 42.0),
       ('female', 18.0), ('male', 35.0), ('female', 18.0), ('male', 25.0),
       ('male', 26.0), ('male', 39.0), ('female', 45.0), ('male', 42.0),
       ('female', 22.0), ('male', nan), ('female', 24.0), ('male', nan),
       ('male', 48.0), ('male', 29.0), ('male', 52.0), ('male', 19.0),
       ('female', 38.0), ('female', 27.0), ('male', nan), ('male', 33.0),
       ('female', 6.0), ('male', 17.0), ('male', 34.0), ('male', 50.0),
       ('male', 27.0), ('male', 20.0), ('female', 30.0), ('female', nan),
       ('male', 25.0), ('female', 25.0), ('female', 29.0), ('male', 11.0),
       ('male', nan), ('male', 23.0), ('male', 23.0), ('male', 28.5),
       ('female', 48.0), ('male', 35.0), ('male', nan), ('male', nan),
       ('male', nan), ('male', 36.0), ('female', 21.0), ('male', 24.0),
       ('male', 31.0), ('male', 70.0), ('male', 16.0), ('female', 30.0),
       ('male', 19.0), ('male', 31.0), ('female', 4.0), ('male', 6.0),
       ('male', 33.0), ('male', 23.0), ('female', 48.0), ('male', 0.67),
       ('male', 28.0), ('male', 18.0), ('male', 34.0), ('female', 33.0),
       ('male', nan), ('male', 41.0), ('male', 20.0), ('female', 36.0),
       ('male', 16.0), ('female', 51.0), ('male', nan), ('female', 30.5),
       ('male', nan), ('male', 32.0), ('male', 24.0), ('male', 48.0),
       ('female', 57.0), ('male', nan), ('female', 54.0), ('male', 18.0),
       ('male', nan), ('female', 5.0), ('male', nan), ('female', 43.0),
       ('female', 13.0), ('female', 17.0), ('male', 29.0), ('male', nan),
       ('male', 25.0), ('male', 25.0), ('female', 18.0), ('male', 8.0),
       ('male', 1.0), ('male', 46.0), ('male', nan), ('male', 16.0),
       ('female', nan), ('male', nan), ('male', 25.0), ('male', 39.0),
       ('female', 49.0), ('female', 31.0), ('male', 30.0),
       ('female', 30.0), ('male', 34.0), ('female', 31.0), ('male', 11.0),
       ('male', 0.42), ('male', 27.0), ('male', 31.0), ('male', 39.0),
       ('female', 18.0), ('male', 39.0), ('female', 33.0), ('male', 26.0),
       ('male', 39.0), ('male', 35.0), ('female', 6.0), ('male', 30.5),
       ('male', nan), ('female', 23.0), ('male', 31.0), ('male', 43.0),
       ('male', 10.0), ('female', 52.0), ('male', 27.0), ('male', 38.0),
       ('female', 27.0), ('male', 2.0), ('male', nan), ('male', nan),
       ('male', 1.0), ('male', nan), ('female', 62.0), ('female', 15.0),
       ('male', 0.83), ('male', nan), ('male', 23.0), ('male', 18.0),
       ('female', 39.0), ('male', 21.0), ('male', nan), ('male', 32.0),
       ('male', nan), ('male', 20.0), ('male', 16.0), ('female', 30.0),
       ('male', 34.5), ('male', 17.0), ('male', 42.0), ('male', nan),
       ('male', 35.0), ('male', 28.0), ('female', nan), ('male', 4.0),
       ('male', 74.0), ('female', 9.0), ('female', 16.0),
       ('female', 44.0), ('female', 18.0), ('female', 45.0),
       ('male', 51.0), ('female', 24.0), ('male', nan), ('male', 41.0),
       ('male', 21.0), ('female', 48.0), ('female', nan), ('male', 24.0),
       ('female', 42.0), ('female', 27.0), ('male', 31.0), ('male', nan),
       ('male', 4.0), ('male', 26.0), ('female', 47.0), ('male', 33.0),
       ('male', 47.0), ('female', 28.0), ('female', 15.0), ('male', 20.0),
       ('male', 19.0), ('male', nan), ('female', 56.0), ('female', 25.0),
       ('male', 33.0), ('female', 22.0), ('male', 28.0), ('male', 25.0),
       ('female', 39.0), ('male', 27.0), ('female', 19.0),
       ('female', nan), ('male', 26.0), ('male', 32.0)], dtype=object)

In [17]:
# 다시 원래대로
multi.reset_index()

,Sex,Age,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,male,22.0,0,3,"Braund, Mr. Owen Harris",1,0,A/5 21171,7.2500,NaN,S
1,female,38.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,C
2,female,26.0,1,3,"Heikkinen, Miss. Laina",0,0,STON/O2. 3101282,7.9250,NaN,S
3,female,35.0,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,0,113803,53.1000,C123,S
4,male,35.0,0,3,"Allen, Mr. William Henry",0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,2,"Montvila, Rev. Juozas",0,0,211536,13.0000,NaN,S
887,female,19.0,1,1,"Graham, Miss. Margaret Edith",0,0,112053,30.0000,B42,S
888,female,NaN,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,2,W./C. 6607,23.4500,NaN,S
889,male,26.0,1,1,"Behr, Mr. Karl Howell",0,0,111369,30.0000,C148,C
890,male,32.0,0,3,"Dooley, Mr. Patrick",0,0,370376,7.7500,NaN,Q

In [18]:
multi.head()

             Survived  Pclass  \
Sex    Age
male   22.0         0       3
female 38.0         1       1
       26.0         1       3
       35.0         1       1
male   35.0         0       3

                                                          Name  SibSp  Parch  \
Sex    Age
male   22.0                            Braund, Mr. Owen Harris      1      0
female 38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...      1      0
       26.0                             Heikkinen, Miss. Laina      0      0
       35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1      0
male   35.0                           Allen, Mr. William Henry      0      0

                       Ticket     Fare Cabin Embarked
Sex    Age
male   22.0         A/5 21171   7.2500   NaN        S
female 38.0          PC 17599  71.2833   C85        C
       26.0  STON/O2. 3101282   7.9250   NaN        S
       35.0            113803  53.1000  C123        S
male   35.0            373450   8.0500   NaN        S

In [ ]:
# male이면서 35인것을 뽑기

In [22]:
multi.loc[("male",35.0),:]

C:\Users\yunaj\AppData\Local\Temp\ipykernel_7712\535921786.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  multi.loc[("male",35.0),:]

           Survived  Pclass                              Name  SibSp  Parch  \
Sex  Age
male 35.0         0       3          Allen, Mr. William Henry      0      0
     35.0         0       2              Fynney, Mr. Joseph J      0      0
     35.0         0       3                   Asim, Mr. Adola      0      0
     35.0         0       3              Rintamaki, Mr. Matti      0      0
     35.0         1       1   Homer, Mr. Harry ("Mr E Haven")      0      0
     35.0         0       3   Brocklebank, Mr. William Alfred      0      0
     35.0         1       1  Silverthorne, Mr. Spencer Victor      0      0
     35.0         1       1            Lesurer, Mr. Gustave J      0      0
     35.0         0       2         Slemen, Mr. Richard James      0      0
     35.0         0       3                Markoff, Mr. Marin      0      0

                       Ticket      Fare Cabin Embarked
Sex  Age
male 35.0              373450    8.0500   NaN        S
     35.0              239865   26.0000   NaN        S
     35.0  SOTON/O.Q. 3101310    7.0500   NaN        S
     35.0   STON/O 2. 3101273    7.1250   NaN        S
     35.0              111426   26.5500   NaN        C
     35.0              364512    8.0500   NaN        S
     35.0            PC 17475   26.2875   E24        S
     35.0            PC 17755  512.3292  B101        C
     35.0               28206   10.5000   NaN        S
     35.0              349213    7.8958   NaN        C

In [26]:
multi.loc[("female"),:].head()

,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Age,,,,,,,,,
38.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,C
26.0,1,3,"Heikkinen, Miss. Laina",0,0,STON/O2. 3101282,7.9250,NaN,S
35.0,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,0,113803,53.1000,C123,S
27.0,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,2,347742,11.1333,NaN,S
14.0,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,0,237736,30.0708,NaN,C

In [33]:
# multiindex 만들기
import random
impor

In [ ]:
# 첫번째 방법

In [54]:
print(type(random.sample(range(1,100),8)))  # list
print(type(np.array(random.sample(range(1,100),8)))) # np로 바꿔줌
np.array(random.sample(range(1,100),8)).shape # 1차원
np.array(random.sample(range(1,100),8)).reshape(4,2) # 2차원

<class 'list'>
<class 'numpy.ndarray'>

array([[40, 33],
       [60, 31],
       [53, 11],
       [ 2, 47]])

In [55]:
df = pd.DataFrame(np.array(random.sample(range(1,100),8)).reshape(4,2), 
             index=[["연아1","연아1","연아2","연아2"], 
                    ["1학기","2학기", "1학기","2학기"]],
             columns=["수학","영어"])
             
df.head()

         수학  영어
연아1 1학기  47  46
    2학기  65  75
연아2 1학기  36  71
    2학기  56  72

In [ ]:
# 두번째 방법

In [56]:
pd.Series({("연아1", "수학"):38,
           ("연아1", "영어"):38,
           ("연아2", "수학"):48,
           ("연아2", "영어"):38,
           ("연아3", "수학"):88,
           ("연아3", "영어"):98,   
    
    
})

연아1  수학    38
     영어    38
연아2  수학    48
     영어    38
연아3  수학    88
     영어    98
dtype: int64

In [58]:
# multiindex 메소드

In [61]:
df = pd.DataFrame(
    [['Mostly cloudy', 10], ['Sunny', 12]],
    index=['London', 'Oxford'],
    columns=['Weather', 'Wind']
)
df

              Weather  Wind
London  Mostly cloudy    10
Oxford          Sunny    12

In [62]:
df.stack()

London  Weather    Mostly cloudy
        Wind                  10
Oxford  Weather            Sunny
        Wind                  12
dtype: object